In [17]:
import numpy as np
import pandas as pd

In [18]:
df=pd.read_excel("filtered_transactions.xlsx")
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [19]:
df.to_csv("filtered_transactions.csv",index=False)
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [20]:
df.head()

   customer_id           name transaction_date       amount category
0          103  Charlie Davis       2022-01-01   759.037390        A
1          436    Alice Brown       2022-01-01  1096.181632        C
2          861    Alice Brown       2022-01-02  1158.623597        B
3          271     Bob Wilson       2022-01-02   859.027857        -
4          107     John Smith       2022-01-02   712.566977        C

In [21]:
df.head(10)

   customer_id           name transaction_date       amount category
0          103  Charlie Davis       2022-01-01   759.037390        A
1          436    Alice Brown       2022-01-01  1096.181632        C
2          861    Alice Brown       2022-01-02  1158.623597        B
3          271     Bob Wilson       2022-01-02   859.027857        -
4          107     John Smith       2022-01-02   712.566977        C
5           72    Alice Brown       2022-01-03   749.303000        B
6          701    Alice Brown       2022-01-03  1280.716021        C
7           21     Bob Wilson       2022-01-03   877.266866        C
8          615     Bob Wilson       2022-01-07  1161.533889        C
9          122     John Smith       2022-01-07  1074.798141        B

In [22]:
df.tail()

      customer_id           name transaction_date       amount category
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

In [23]:
df.tail(8)

      customer_id           name transaction_date       amount category
1042          458  Charlie Davis       2023-12-26   844.239348        B
1043           83    Alice Brown       2023-12-26   814.955767        C
1044          145     John Smith       2023-12-27  1250.943452        B
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

In [24]:
df.sample()

     customer_id         name transaction_date       amount category
710          168  Alice Brown       2023-05-10  1133.624175        C

In [25]:
df.sample(5)

     customer_id           name transaction_date       amount category
777           62    Alice Brown       2023-06-25   743.065484        C
624          601  Charlie Davis       2023-03-06   873.043263        C
184          871     John Smith       2022-05-09   781.212449        B
187          207     Bob Wilson       2022-05-10  1273.968773        B
396          254  Charlie Davis       2022-10-14  1250.845931        A

In [26]:
# Missing values
df.isna()

      customer_id   name  transaction_date  amount  category
0           False  False             False   False     False
1           False  False             False   False     False
2           False  False             False   False     False
3           False  False             False   False     False
4           False  False             False   False     False
...           ...    ...               ...     ...       ...
1045        False  False             False   False     False
1046        False  False             False   False     False
1047        False  False             False   False     False
1048        False  False             False   False     False
1049        False  False             False   False     False

[1050 rows x 5 columns]

In [27]:
df.isna().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [28]:
df.isnull()

      customer_id   name  transaction_date  amount  category
0           False  False             False   False     False
1           False  False             False   False     False
2           False  False             False   False     False
3           False  False             False   False     False
4           False  False             False   False     False
...           ...    ...               ...     ...       ...
1045        False  False             False   False     False
1046        False  False             False   False     False
1047        False  False             False   False     False
1048        False  False             False   False     False
1049        False  False             False   False     False

[1050 rows x 5 columns]

In [29]:
df.isnull().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

Categorical / Qualitative data
1.nominal
2.ordinal

Numerical / Quantitative data
1.descript
2.countinue

In [30]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [31]:
df.dtypes

customer_id                  int64
name                        object
transaction_date    datetime64[ns]
amount                     float64
category                    object
dtype: object

In [32]:
df["transaction_date"]

0      2022-01-01
1      2022-01-01
2      2022-01-02
3      2022-01-02
4      2022-01-02
          ...
1045   2023-12-27
1046   2023-12-27
1047   2023-12-28
1048   2023-12-28
1049   2023-12-30
Name: transaction_date, Length: 1050, dtype: datetime64[ns]

In [33]:
from datetime import datetime

In [34]:
ans = datetime.strptime(str(df['transaction_date'][1046])[:10], "%Y-%m-%d") \
          .strftime("%d-%m-%Y")
print(ans)

27-12-2023

In [35]:
all_dates=[]
for date in df ["transaction_date"]:
    all_dates.append(datetime.strptime(str(df['transaction_date'][1046])[:10], "%Y-%m-%d") \
          .strftime("%d/%m/%Y"))
    
date_series=pd.Series(all_dates)
date_series

0       27/12/2023
1       27/12/2023
2       27/12/2023
3       27/12/2023
4       27/12/2023
           ...
1045    27/12/2023
1046    27/12/2023
1047    27/12/2023
1048    27/12/2023
1049    27/12/2023
Length: 1050, dtype: object

In [36]:
df["transaction_date"]=date_series

In [37]:
df["transaction_date"]

0       27/12/2023
1       27/12/2023
2       27/12/2023
3       27/12/2023
4       27/12/2023
           ...
1045    27/12/2023
1046    27/12/2023
1047    27/12/2023
1048    27/12/2023
1049    27/12/2023
Name: transaction_date, Length: 1050, dtype: object

In [38]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       27/12/2023   759.037390        A
1             436    Alice Brown       27/12/2023  1096.181632        C
2             861    Alice Brown       27/12/2023  1158.623597        B
3             271     Bob Wilson       27/12/2023   859.027857        -
4             107     John Smith       27/12/2023   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       27/12/2023   761.082210        C
1046           78    Alice Brown       27/12/2023  1003.574745        B
1047          457  Charlie Davis       27/12/2023   832.511670        C
1048          878  Charlie Davis       27/12/2023   723.357978        B
1049            1     Bob Wilson       27/12/2023   721.611291        C

[1050 rows x 5 columns]

In [39]:
df["transaction_date"].head(10)

0    27/12/2023
1    27/12/2023
2    27/12/2023
3    27/12/2023
4    27/12/2023
5    27/12/2023
6    27/12/2023
7    27/12/2023
8    27/12/2023
9    27/12/2023
Name: transaction_date, dtype: object

In [40]:
import pandas as pd

In [41]:
df["transaction_date"] = pd.to_datetime(df["transaction_date"], dayfirst=True)

print(df["transaction_date"])

0      2023-12-27
1      2023-12-27
2      2023-12-27
3      2023-12-27
4      2023-12-27
          ...
1045   2023-12-27
1046   2023-12-27
1047   2023-12-27
1048   2023-12-27
1049   2023-12-27
Name: transaction_date, Length: 1050, dtype: datetime64[ns]

In [42]:
df["transaction_date"]

0      2023-12-27
1      2023-12-27
2      2023-12-27
3      2023-12-27
4      2023-12-27
          ...
1045   2023-12-27
1046   2023-12-27
1047   2023-12-27
1048   2023-12-27
1049   2023-12-27
Name: transaction_date, Length: 1050, dtype: datetime64[ns]

In [43]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2023-12-27   759.037390        A
1             436    Alice Brown       2023-12-27  1096.181632        C
2             861    Alice Brown       2023-12-27  1158.623597        B
3             271     Bob Wilson       2023-12-27   859.027857        -
4             107     John Smith       2023-12-27   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-27   832.511670        C
1048          878  Charlie Davis       2023-12-27   723.357978        B
1049            1     Bob Wilson       2023-12-27   721.611291        C

[1050 rows x 5 columns]

In [44]:
df.isnull().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [45]:
# Missing value

In [46]:
df.dropna(inplace=True)

In [47]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2023-12-27   759.037390        A
1             436    Alice Brown       2023-12-27  1096.181632        C
2             861    Alice Brown       2023-12-27  1158.623597        B
3             271     Bob Wilson       2023-12-27   859.027857        -
4             107     John Smith       2023-12-27   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-27   832.511670        C
1048          878  Charlie Davis       2023-12-27   723.357978        B
1049            1     Bob Wilson       2023-12-27   721.611291        C

[1050 rows x 5 columns]

In [48]:
df.isna().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [49]:
df=pd.read_csv("filtered_transactions.csv")

In [50]:
df.isna().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [51]:
df["category"]=df["category"].fillna("-")

In [52]:
df.isna().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [53]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [60]:
df["amount"] = df["amount"].fillna(df["amount"].mean())
# df["amount"].fillna(df["amount"].mean(),inplace=True)

In [58]:
df.isna().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [61]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1045    False
1046    False
1047    False
1048    False
1049    False
Length: 1050, dtype: bool

In [62]:
print(df.duplicated().sum())

0

In [63]:
df.drop_duplicates(inplace=True)

In [64]:
df.duplicated().sum()

np.int64(0)

In [65]:
df.dtypes

customer_id           int64
name                 object
transaction_date     object
amount              float64
category             object
dtype: object

In [66]:
ndf=df["amount"].astype(int)

In [67]:
ndf.dtypes

dtype('int64')

In [68]:
ndf

0        759
1       1096
2       1158
3        859
4        712
        ...
1045     761
1046    1003
1047     832
1048     723
1049     721
Name: amount, Length: 1050, dtype: int64

In [69]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [70]:
ndf=df["amount"].astype("int32")

In [72]:
ndf.dtypes

dtype('int32')

In [73]:
ndf

0        759
1       1096
2       1158
3        859
4        712
        ...
1045     761
1046    1003
1047     832
1048     723
1049     721
Name: amount, Length: 1050, dtype: int32

In [74]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]